server/rpc/test_data/download_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">123</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:Download>
            <CommandKey xsi:type="xsd:string">FirmwareUpgrade</CommandKey>
            <FileType xsi:type="xsd:string">1 Firmware Upgrade Image</FileType>
            <URL xsi:type="xsd:string">https://acme-networks.com/firmware/downloads/firmware.bin</URL>
            <Username xsi:type="xsd:string">cpe</Username>
            <Password xsi:type="xsd:string">secret</Password>
            <FileSize xsi:type="xsd:long">184258350</FileSize>
            <TargetFileName xsi:type="xsd:string">firmware.bin</TargetFileName>
            <DelaySeconds xsi:type="xsd:int">0</DelaySeconds>
            <SuccessURL xsi:type="xsd:string">http://success</SuccessURL>
            <FailureURL xsi:type="xsd:string">http://failure</FailureURL>
        </cwmp:Download>
    </soapenv:Body>
</soapenv:Envelope>
